app/controllers/locations_controller.rb

  def index
    @locations = Location.all(:order => "created_at DESC")
---
SELECT * FROM `locations`

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 1)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 1)

  def update
    @render_action = "edit"
    @location = Location.find(params[:id])
    @location.update_attributes(params[:location])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
UPDATE `locations` SET `name` = 'philly', `full_address` = '1001 N 2nd St, Philadelphia, PA 19123, USA', `street_address` = '1001 N 2nd St', `city` = 'Philadelphia', `state` = 'PA', `zip` = '19123', `country_code` = 'US', `province` = 'Philadelphia', `lat` = 39.9667456, `lng` = -75.1401276, `updated_at` = '2010-03-02 21:39:22' WHERE `id` = 6

  def destroy
    if authorized?
      flash[:notice] = 'Location was successfully destroyed.'
      @location = Location.find(params[:id])
      @location.destroy
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 5)
DELETE FROM `locations` WHERE `id` = 5