app/controllers/posts_controller.rb

SELECT * FROM `posts` ORDER BY created_at DESC
---
  def index
    @posts = Post.all(:order => "created_at DESC")

INSERT INTO `posts` (`title`, `content`, `user_id`, `created_at`, `updated_at`) VALUES('first post', 'testing whether or not posting of blogs works', 3, '2010-02-26 02:01:37', '2010-02-26 02:01:37')
---
  def create
    @post = Post.new(params[:post])
    @post.user = current_user

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
UPDATE `posts` SET `content` = 'the main purpose of the site is to store info about locations, without locations, theres no reason to visit site. do it! \r\ncan look at prototype of site to get location fields, will require geokit, validating addresses', `updated_at` = '2010-02-26 20:57:53' WHERE `id` = 4
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])