app/controllers/users_controller.rb

INSERT INTO `users` (`login`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`, `reset_code`) VALUES('textual', '', 'mr.dan.marks@gmail.com', '7b0a805654d8790a09f82733ab4f308f15168789', '447879d21e731dd55bc5aaf0e7ddad4f9fd9d299', '2010-02-25 20:46:19', '2010-02-25 20:46:19', NULL, NULL, NULL)
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM `users` WHERE (`users`.`email` = 'whatever') LIMIT 1
---
  def forgot
    if request.post?
      user = User.find_by_email(params[:user][:email])

SELECT * FROM `users` WHERE (`users`.`reset_code` = '9f8ca778987189ec978a907f380d4f999e4cc278') LIMIT 1
UPDATE `users` SET `crypted_password` = '696355d12f1685c1669bbe3fd79a9812992e5c03', `updated_at` = '2010-02-25 22:57:44' WHERE `id` = 3
---
  def reset
    @user = User.find_by_reset_code(params[:reset_code]) unless params[:reset_code].nil?
      if request.post?
        if @user.update_attributes(:password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])